<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Prefix for success logs
    |--------------------------------------------------------------------------
    */
    'success_prefix' => 'success',

    /*
    |--------------------------------------------------------------------------
    | Prefix for unsuccess logs
    |--------------------------------------------------------------------------
    */
    'error_prefix' => 'error',

    /*
    |--------------------------------------------------------------------------
    | User model path
    |--------------------------------------------------------------------------
    */
    'user_model' => App\Models\User::class,

    /*
    |--------------------------------------------------------------------------
    | User resource model for LogResource
    |--------------------------------------------------------------------------
    */
    'user_resource' => [\App\Modules\Base\Resources\UserShortResource::class, 'once'],

    /*
    |--------------------------------------------------------------------------
    | Action Log slugs for seeder
    |--------------------------------------------------------------------------
    */
    'slug_list' => [],

    'repository' => [
        /*
        |--------------------------------------------------------------------------
        | Description Generator
        |--------------------------------------------------------------------------
        |
        | Функция для генерации описания действия. Принимает текущего аутентифицированного
        | пользователя и объект ActionLog, возвращает строку.
        |
        */
        'description_callback' => null, // null означает, что будет использован дефолт
    ],

    /*
    |--------------------------------------------------------------------------
    | Count create Logs in log factory
    |--------------------------------------------------------------------------
    */
    'logs_factory_count' => env('LOG_FACTORY', 1000),
];
